internal social network/bt9/app/controllers/users_controller.rb

  def index
    @email = params[:email]
    @users =  @email.present? ? User.where(email: @email) : User.all
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'thang'
SELECT 1 AS one FROM `users` WHERE `users`.`email` = 'codonlathe@gmail.com' LIMIT 1

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO `users` (`name`, `email`, `date_of_birth`, `gender`, `created_at`, `updated_at`, `password_digest`, `phone`, `age`) VALUES ('tran huu thang', 'thang1@gmail.com', '13/02/2000', 'nam', '2021-07-24 12:52:32.011954', '2021-07-24 12:52:32.011954', 'aaaaaaaaaaa', 372964842, 21)

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE `users` SET `users`.`email` = 'tranhuuthangcoi@gmail.com', `users`.`updated_at` = '2021-07-26 07:58:03.585863', `users`.`password_digest` = '$2a$12$MP03oH2Nz/AeCdU8RSDv7ez8i8Hfma0d4FUoxzaFO2Ik0gRwDG62y' WHERE `users`.`id` = 46