Ecommerce/app/controllers/blog_controller.rb

  def load_layout
    posts = Post.newest.page(params[:page]).per(3)
    categories = Category.show_category.limit(4)
    brands = Brand.all
---
SELECT `categories`.* FROM `categories` WHERE `categories`.`categories_id` IS NULL LIMIT 4
SELECT `brands`.* FROM `brands`