Ecommerce/app/controllers/blog_controller.rb

SELECT `posts`.* FROM `posts` ORDER BY `posts`.`created_at` DESC LIMIT 3 OFFSET 0
SELECT `category_posts`.* FROM `category_posts`
SELECT `product_views`.`post_id` FROM `product_views` WHERE `product_views`.`post_id` IS NOT NULL AND `product_views`.`post_id` IN (4, 4) GROUP BY `product_views`.`post_id` ORDER BY post_id DESC
SELECT COUNT(*) AS count_all, `product_views`.`post_id` AS product_views_post_id FROM `product_views` WHERE `product_views`.`post_id` IS NOT NULL GROUP BY `product_views`.`post_id` ORDER BY post_id DESC
---
  def load_layout
    posts = Post.newest.page(params[:page]).per(3)
    categoies_post = CategoryPost.all
    product_views = ProductView.select(:post_id).where.not(post_id: nil).group(:post_id).order('post_id DESC')
    post_ids = product_views.size.values.sort.reverse.take(5).map { |item| product_views.size.key(item) }

SELECT `notifications`.* FROM `notifications` ORDER BY `notifications`.`created_at` DESC LIMIT 5
---
  def load_notification
    @notifications = Notification.newest.limit(5)