Ecommerce/app/controllers/carts_controller.rb

  def index
    notifications = Notification.newest.limit(5)
---
SELECT `notifications`.* FROM `notifications` ORDER BY `notifications`.`created_at` DESC LIMIT 5