Ecommerce/app/controllers/categories_controller.rb

  def categories
    id = params[:id].match(/\d+$/)[0].to_i
    products = Product.where(categories_id: id).page(params[:page]).per(6)
    categories = Category.show_category.limit(4)
    brands = Brand.all
    notifications = Notification.newest.limit(5)
---
SELECT `products`.* FROM `products` WHERE `products`.`categories_id` = 3 LIMIT 6 OFFSET 0
SELECT `categories`.* FROM `categories` WHERE `categories`.`categories_id` IS NULL LIMIT 4
SELECT `brands`.* FROM `brands`
SELECT `notifications`.* FROM `notifications` ORDER BY `notifications`.`created_at` DESC LIMIT 5