Ecommerce/app/controllers/home_controller.rb

  def index
    features_items =  Product.show_products Product::SHOW_HOME[:recomand]
    recommend_items = Product.show_products Product::SHOW_HOME[:feature]
    categories = Category.show_category.limit(4)
    sliders = Slider.all
    brands = Brand.all
    notifications = Notification.newest.limit(5)
    availabilities = Availability.by_product_sold(0).order(product_sold: :desc).limit(5).shuffle

    @results = {
      features_items: features_items.page(params[:page]).per(9),
      recommend_items: recommend_items,
      categories: categories,
      sliders: sliders,
      brands: brands,
      notifications: notifications,
      availabilities: availabilities
---
SELECT `products`.* FROM `products` WHERE `products`.`show_home` != 0 LIMIT 9