Ecommerce/app/controllers/home_controller.rb

SELECT `categories`.* FROM `categories` WHERE `categories`.`categories_id` IS NULL LIMIT 4
SELECT `brands`.* FROM `brands`
SELECT `notifications`.* FROM `notifications` ORDER BY `notifications`.`created_at` DESC LIMIT 5
SELECT `availabilities`.* FROM `availabilities` WHERE (product_sold > 10) ORDER BY `availabilities`.`product_sold` DESC
SELECT COUNT(*) FROM `products` WHERE `products`.`brand_id` = 1
SELECT `products`.* FROM `products` WHERE `products`.`show_home` != 0 LIMIT 6 OFFSET 6
---
  def index
    features_items =  Product.show_products Product::SHOW_HOME[:recomand]
    recommend_items = Product.show_products Product::SHOW_HOME[:feature]
    categories = Category.show_category.limit(4)
    sliders = Slider.all
    brands = Brand.all
    notifications = Notification.newest.limit(5)
    availabilities = Availability.by_product_sold(10).order(product_sold: :desc).sample(5)
    @results = {
      features_items: features_items.page(params[:page]).per(6),
      recommend_items: recommend_items,
      show_load_more: features_items.page(2).per(6).present? ? true : false,
      categories: categories,
      sliders: sliders,
      brands: brands,
      notifications: notifications,
      availabilities: availabilities