Ecommerce/app/controllers/product_details_controller.rb

SELECT `product_views`.* FROM `product_views` WHERE `product_views`.`ip_address` = '127.0.0.1' AND `product_views`.`product_id` = 1 LIMIT 1
INSERT INTO `product_views` (`product_id`, `ip_address`, `created_at`, `updated_at`, `user_id`) VALUES (1, '127.0.0.1', '2022-02-12 09:06:43.271214', '2022-02-12 09:06:43.271214', 1)
SELECT `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `categories`.* FROM `categories` WHERE `categories`.`categories_id` IS NULL LIMIT 4
SELECT `products`.* FROM `products` WHERE `products`.`categories_id` IS NULL LIMIT 4
SELECT `product_rates`.* FROM `product_rates` WHERE `product_rates`.`product_id` = 1
SELECT `sizes`.* FROM `sizes` INNER JOIN `product_sizes` ON `sizes`.`id` = `product_sizes`.`size_id` WHERE `product_sizes`.`product_id` = 1
SELECT `brands`.* FROM `brands`
SELECT `notifications`.* FROM `notifications` ORDER BY `notifications`.`created_at` DESC LIMIT 5
---
  def index
    env_http_forwarded = request.env['HTTP_X_FORWARDED_FOR']

    client_ip = if env_http_forwarded
                  env_http_forwarded.split(',').first
                else
                  request.remote_ip
                end
    id = params[:id].match(/\d+$/)[0].to_i
    product_view = ProductView.new(product_id: id, ip_address: client_ip, city: request.location.city, user_id: current_user ? current_user.id : '') # when user don't login or was logged before ago
    p_view = ProductView.find_by(ip_address: client_ip, product_id: id)
    if current_user && p_view&.ip_address == client_ip # && p_view.user_id.blank? # when user login
      p_view.update_attribute(:user_id, current_user.id)
    end
    product_view.save(validate: false) unless p_view
    p_view&.touch(:updated_at) if p_view&.user_id == current_user&.id # update updated_at viewing history
    recommend_items = Product.show_products Product::SHOW_HOME[:feature]
    product = Product.find(id)
    admin = User.find(product.user_id)
    categories = Category.show_category.limit(4)
    products = Product.where(categories_id: product.categories_id).limit(4)
    comment_user = Comment.includes(:user)
    comments = comment_user.where(product_id: id).where(main_id: comment_user.pluck('main_id').compact).page(params[:page]).per(6)
    product_rates = ProductRate.where(product_id: id)
    sum_rate = product_rates.sum(&:rate)
    count_product = product_rates.size
    avg = count_product.zero? ? 5 : sum_rate / count_product
    brands = Brand.all
    notifications = Notification.newest.limit(5)