Ecommerce/app/controllers/api/v1/categories_controller.rb

  def index
    categories = Category.where(categories_id: params[:categories_id]).limit(4)
---
SELECT `categories`.* FROM `categories` WHERE `categories`.`categories_id` = 1 LIMIT 4