Ecommerce/app/controllers/api/v1/loves_controller.rb

      def rate
        data = []
        data << @user.order_items.this_status('1').pluck('product_order').map { |x| JSON.parse(x) }
        if @user.order_items.present? && data.flatten.pluck('id').include?(params[:product_id])
          rate = @user.product_rates.new(rate: params[:rate], product_id: params[:product_id], user_id: @user.id)
          product_rates = ProductRate.where(product_id: params[:product_id]).to_a
          sum_rate = product_rates.sum(&:rate)
          count_product = product_rates.size
          avg = count_product.zero? ? params[:rate] : sum_rate / count_product
          if rate.save
---
SELECT `product_rates`.* FROM `product_rates` WHERE `product_rates`.`product_id` = 1
SELECT `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1
INSERT INTO `product_rates` (`user_id`, `product_id`, `rate`, `created_at`, `updated_at`) VALUES (1, 1, 4, '2022-02-12 09:07:05.699157', '2022-02-12 09:07:05.699157')

      def load_user
        token = params[:token]
        hmac_secret = 'rubyk01'
        decoded_token = JWT.decode token, hmac_secret, true, { algorithm: 'HS256' }

        @user = User.find_by(api_token_digest: decoded_token.first['data'])
---
SELECT `users`.* FROM `users` WHERE `users`.`api_token_digest` = 'oKfjbTNUjQ4pV5vF7n9Nzw' LIMIT 1