Ecommerce/lib/rails_admin.rb

SELECT `order_items`.`fee` FROM `order_items` WHERE (status = 1) AND (extract(month from created_at) = 2) AND (extract(year from created_at) = 2022) ORDER BY `order_items`.`created_at` DESC
SELECT `order_items`.`voucher` FROM `order_items` WHERE (status = 1) AND (extract(month from created_at) = 2) AND (extract(year from created_at) = 2022) ORDER BY `order_items`.`created_at` DESC
---
            def load_order_items(month, year)
              order_items = OrderItem.this_status(Product::STATUS[:confirmed])
                                     .by_orders(month, year)
              fee_ship = order_items.pluck('fee').sum
              voucher = order_items.pluck('voucher').sum

SELECT COUNT(*) FROM `vouchers` WHERE (extract(month from created_at) = 2) AND (extract(year from created_at) = 2022)
---
            def base_statistic_products(product_id = {}, month, year)

              product_views = ProductView.by_month_year(month, year)

              product_view_ids = product_views.present? && product_views.pluck('product_id').compact.each_with_object(Hash.new(0)) do |c, counts|

                counts[c] += 1
              end.max_by do |_k, v|
                v
              end [0]
              if product_id != {}

                products = Product.by_ids([product_id, product_view_ids])

                result = products.find_by!(id: product_id)
              else

                result = nil
              end
              keywords = KeywordSearch.by_keywords(month, year)
              {
                best_seller: result,
                best_keyword_search: keywords.present? ? keywords.find_by!(count: keywords.pluck('count').max) : nil,
                best_product_views: products.find_by(id: product_view_ids),

                vouchers: Voucher.by_vouchers(month, year).size

SELECT COUNT(*) FROM `availabilities`
---
            def result_statistic
              year = params[:month_year] ? params['month_year'].split('-')[0] : Time.zone.now.year
              month = params[:month_year] ? params['month_year'].split('-')[1] : Time.zone.now.month
              data = load_order_items(month, year)
              @result = {
                data: order_items(data[:order_items]).pluck('total').sum + data[:fee_ship_voucher],
                sold: order_items(data[:order_items]).size,
                year: year,
                month: month,
                statistic_products: statistic_products(data[:order_items], params[:month_year])
              }
            end
            result_statistic

            # product sold of this month
            @total_availabilitys = Availability.all.size