internal social network/bt9/app/helpers/sessions_helper.rb

  def current_user
    @current_user ||= User.find_by(id: session[:user_id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1