Ecommerce/app/views/blog/index.html.erb

      <div class="search_box pull-right">
        <input class="in-search-blog" id="search-blog" data-autocomplete-source="<%= Post.order("title").map(&:title)%>" type="text" style="color: #000; font-weight: 700;" placeholder="<%= t 'blogs.search_post' %>">
---
SELECT `posts`.* FROM `posts` ORDER BY title