Ecommerce/app/views/rails_admin/main/dashboard.html.erb

              class="MuiSvgIcon-root-19" focusable="false" viewBox="0 0 24 24" aria-hidden="true" role="presentation">
            </svg></h4><span class="hind-font caption-12 c-dashboardInfo__count"><%= Product.pluck("id").size%></span>
---
SELECT `products`.`id` FROM `products`

            </svg></h4>
            <% if @result[:statistic_products][:best_product_views].present? %>
---
SELECT `product_views`.* FROM `product_views` WHERE (extract(month from created_at) = 2) AND (extract(year from created_at) = 2022) ORDER BY product_id DESC

  <h3> About order for the week </h3>
    <%= column_chart  OrderItem.unscoped.group_by_day_of_week(:created_at,format: "%a").count %>
      <h3> About order status  </h3>
    <%=  pie_chart OrderItem.select('order_items.status').unscoped.group("order_items.status").count%>
---
SELECT `order_items`.* FROM `order_items` WHERE (status = 1) AND (extract(month from created_at) = 2) AND (extract(year from created_at) = 2022) ORDER BY `order_items`.`created_at` DESC
SELECT COUNT(*) AS count_all, DAYOFWEEK(CONVERT_TZ(`order_items`.`created_at`, '+00:00', 'Europe/Paris')) - 1 AS dayofweek_convert_tz_order_items_created_at_00_00_europe_paris_1 FROM `order_items` WHERE (`order_items`.`created_at` IS NOT NULL) GROUP BY DAYOFWEEK(CONVERT_TZ(`order_items`.`created_at`, '+00:00', 'Europe/Paris')) - 1
SELECT COUNT(*) AS count_all, `order_items`.`status` AS order_items_status FROM `order_items` GROUP BY `order_items`.`status`

      <h3> About statistical user/admin </h3>
    <%= pie_chart User.group(:admin).count %>
      <h3> About Product for Brand </h3>
    <%=  bar_chart Brand.select('brands.name').joins(:products).group("brands.name").count %>
      <h3> About Order for month </h3>
    <%= column_chart OrderItem.this_status(Product::STATUS[:confirmed]).unscoped.group_by_month(:created_at, format: "%b %Y").count%>
---
SELECT COUNT(*) AS count_all, `users`.`admin` AS users_admin FROM `users` GROUP BY `users`.`admin`
SELECT COUNT(`brands`.`name`) AS count_brands_name, `brands`.`name` AS brands_name FROM `brands` INNER JOIN `products` ON `products`.`brand_id` = `brands`.`id` GROUP BY `brands`.`name`
SELECT COUNT(*) AS count_all, CONVERT_TZ(DATE_FORMAT(CONVERT_TZ(`order_items`.`created_at`, '+00:00', 'Europe/Paris'), '%Y-%m-01 00:00:00'), 'Europe/Paris', '+00:00') AS convert_tz_date_format_convert_tz_order_items_created_at_00_00_europe_paris_y_m_01_00_00_00_europe_paris_00_00 FROM `order_items` WHERE (`order_items`.`created_at` IS NOT NULL) GROUP BY CONVERT_TZ(DATE_FORMAT(CONVERT_TZ(`order_items`.`created_at`, '+00:00', 'Europe/Paris'), '%Y-%m-01 00:00:00'), 'Europe/Paris', '+00:00')