Ecommerce/app/views/rails_admin/main/dashboard.html.erb

            <h4 class="heading heading5 hind-font medium-font-weight c-dashboardInfo__title"><%= t "admin.statistic_product.best_Keyword_search"%> <%= @result[:month] %>/<%= @result[:year] %>
              <% if  @result[:statistic_products][:best_keyword_search].present? %>
---
SELECT `keyword_searches`.* FROM `keyword_searches` WHERE (extract(month from created_at) = 2) AND (extract(year from created_at) = 2022) ORDER BY count ASC