internal social network/bt11/app/controllers/microposts_controller.rb

SELECT `microposts`.* FROM `microposts` WHERE `microposts`.`content` = 'content 2'
---
  def index
    @content = params[:content]
    @microposts = @content.present? ? Micropost.where(content: @content) : Micropost.all

INSERT INTO `microposts` (`user_id`, `content`, `created_at`, `updated_at`) VALUES (64, 'content 4', '2021-07-29 02:36:45.048031', '2021-07-29 02:36:45.048031')
---
  def create
    @micropost = Micropost.new(micropost_params)

    respond_to do |format|
      if @micropost.save

UPDATE `microposts` SET `microposts`.`content` = 'chán đời quá, muốn chết đi cho rồi', `microposts`.`updated_at` = '2021-07-29 02:47:01.512416' WHERE `microposts`.`id` = 7
---
  def update
    respond_to do |format|
      if @micropost.update(micropost_params)

SELECT `microposts`.* FROM `microposts` WHERE `microposts`.`id` = 1 LIMIT 1
---
  def set_micropost
    @micropost = Micropost.find(params[:id])