internal social network/bt11/app/controllers/users_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`email` = 'thang'
SELECT 1 AS one FROM `users` WHERE `users`.`email` = 'codonlathe@gmail.com' LIMIT 1
---
  def index
    @email = params[:email]
    @users = @email.present? ? User.where(email: @email) : User.all

INSERT INTO `users` (`name`, `email`, `date_of_birth`, `gender`, `created_at`, `updated_at`, `password_digest`, `phone`, `age`) VALUES ('tran huu thang', 'thangdz@gmail.com', '13/02/2000', 'male', '2021-07-25 13:42:28.879889', '2021-07-25 13:42:28.879889', '$2a$12$xaPsl36626xpn0oP1b.Qt.UxblMHFftbTFWCQDuMUEZGmY4TgMoTS', 372964842, 14)
---
  def create
    @user = User.new(user_params)
    if @user.save

UPDATE `users` SET `users`.`date_of_birth` = '06/05/2001', `users`.`gender` = 'nam', `users`.`updated_at` = '2021-07-25 03:30:34.621099', `users`.`password_digest` = '$2a$12$KxsRhZ5HAD692cs3uoGBVOtUMVqZS0wxMSqJE6UIsof2sDXQ3Uie.', `users`.`phone` = 986555942, `users`.`age` = 18 WHERE `users`.`id` = 20
---
  def update
    respond_to do |format|
      if @user.update(user_params)

DELETE FROM `users` WHERE `users`.`id` = 22
---
  def destroy
    @user.destroy