Ecommerce/app/controllers/users/registrations_controller.rb

SELECT `notifications`.* FROM `notifications` ORDER BY `notifications`.`created_at` DESC LIMIT 5
SELECT `cities`.* FROM `cities`
---
    def load_notification
      notifications = Notification.newest.limit(5)
      cities = City.all