Ecommerce/app/views/layouts/_header.html.erb

          <div class="search_box pull-right">
            <input class="in-search" id="search-product" data-autocomplete-source="<%= Product.order("title").map(&:title)%>" type="text" style="color: #000; font-weight: 700;" placeholder="<%= t "product.search" %>"/>
---
SELECT `products`.* FROM `products` ORDER BY title