Ecommerce/app/models/product.rb

SELECT COUNT(*) FROM `product_views` WHERE `product_views`.`product_id` = 1
---
  def add_default_image
    return if image.attached?

    image.attach(io: File.open(Rails.root.join('app', 'assets', 'images', 'product_default.jpg')),
                 filename: 'product_default.jpg',
                 content_type: 'image/jpg')
  end

  rails_admin do
    configure :product_views do
      pretty_value do
        util = bindings[:object]
        %(#{util.product_views.count} 👁️‍🗨️ )

SELECT `brands`.* FROM `brands`
---
      field :image
      field :brand_id, :enum do
        enum do
          Brand.all.collect { |c| [c.name, c.id] }