Ecommerce/app/models/user.rb

  def generate_token
    api_token = User.new_token
    self.update_attribute(:api_token_digest, api_token)
---
UPDATE `users` SET `users`.`updated_at` = '2022-02-12 09:04:19.980931', `users`.`api_token_digest` = 'oKfjbTNUjQ4pV5vF7n9Nzw' WHERE `users`.`id` = 1