internal social network/bt10/app/views/users/new.html.erb

SELECT 1 AS one FROM `users` WHERE `users`.`email` = 'thang@gmail.com' LIMIT 1
---
                        <label for="email">Email address</label>
                        <input type="email" class="form-control form-control-sm" id="email" name="user[email]" aria-describedby="email" value="<%= @user.email.present? ? @user.email : ''%> ">