internal social network/bt10/app/views/users/show.html.erb

<% @microposts.each do |m| %>
  <% m.microposts.each do |item| %>
---
SELECT `microposts`.* FROM `microposts` WHERE `microposts`.`user_id` = 62