Ecommerce/app/views/devise/sessions/new.html.erb

SELECT `cities`.* FROM `cities`
---
                    </div>
                    <span><%= t 'profiles.select_city' %> </span>

SELECT `cities`.* FROM `cities`
---
                        <select  name="user[city_id]">
                          <% City.all.each do |item| %>