Ecommerce/app/views/product_details/index.html.erb

SELECT `photos`.* FROM `photos` WHERE `photos`.`product_id` = 1 LIMIT 3
---
                            <div class="item active">
                                <% @results[:product].photos.take(3).each do |item| %>

SELECT `photos`.* FROM `photos` WHERE `photos`.`product_id` = 1
---
                            <div class="item">
                               <% @results[:product].photos.each.with_index do |item, index| %>

SELECT `product_rates`.* FROM `product_rates` WHERE `product_rates`.`user_id` = 1 AND `product_rates`.`product_id` = 1
---
                              <% if user_signed_in? %>
                                <% if ProductRate.where(user_id: current_user.id, product_id: @results[:product].id).present? %>

SELECT 1 AS one FROM `product_favorites` WHERE `product_favorites`.`user_id` = 1 AND `product_favorites`.`product_id` = 1 LIMIT 1
---
                             <% if user_signed_in? %>
                                    <% if (current_user.product_favorites.where(product_id: @results[:product].id)).exists? %>

SELECT COUNT(*) FROM `product_views` WHERE `product_views`.`product_id` = 1
---
                            <p><b>Brand:</b> <%= @results[:product].brand ? @results[:product].brand.name : "" %></p>
                            <p><b>View: </b> <%= @results[:product].product_views.count %> <i class="fa fa-eye"></i></p>