internal social network/bt8/app/controllers/microposts_controller.rb

  def index
    @content = params[:content]
    @microposts = @content.present? ? Micropost.where(content: @content) : Micropost.all
---
SELECT `microposts`.* FROM `microposts` WHERE `microposts`.`content` = 'content 2'

  def create
    @micropost = Micropost.new(micropost_params)

    respond_to do |format|
      if @micropost.save
---
INSERT INTO `microposts` (`user_id`, `content`, `created_at`, `updated_at`) VALUES (3, 'content 3', '2021-07-22 08:34:10.168115', '2021-07-22 08:34:10.168115')

  def set_micropost
    @micropost = Micropost.find(params[:id])
---
SELECT `microposts`.* FROM `microposts` WHERE `microposts`.`id` = 3 LIMIT 1