internal social network/bt8/app/controllers/users_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`email` = 'thang'
---
  def index
    @email = params[:email]
    @users =  @email.present? ? User.where(email: @email) : User.all

INSERT INTO `users` (`name`, `email`, `date_of_birth`, `gender`, `created_at`, `updated_at`, `password_digest`, `phone`, `age`) VALUES ('tran huu thang', 'thang@gmail.com', '13/02/2000', 'false', '2021-07-25 04:00:17.131809', '2021-07-25 04:00:17.131809', '$2a$12$e4745XYFes7c5XZaXBb6vu8JpGb9mrUzgjt3lzckTvbhnD5m1OlRy', 372964842, 21)
---
  def create
    @user = User.new(user_params)
    respond_to do |format|
      if @user.save

UPDATE `users` SET `users`.`gender` = 'false', `users`.`updated_at` = '2021-07-25 03:59:27.964676' WHERE `users`.`id` = 27
---
  def update
    respond_to do |format|
      if @user.update(user_params)

DELETE FROM `users` WHERE `users`.`id` = 34
---
  def destroy
    @user.destroy