Ecommerce/app/views/home/_best_view_blog.html.erb

    <% @results[:best_view_post].each do |item| %>
    <% if item.post.present? %>
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 4 LIMIT 1

                    <p class="title" style="font-weight: 700"><%= item.post.title  %> </p>
                    <p class="views">Views: <%= item.post.product_views.count   %></p>
---
SELECT COUNT(*) FROM `product_views` WHERE `product_views`.`post_id` = 4