Ecommerce/app/views/home/_brands.html.erb

    <ul class="nav nav-pills nav-stacked">
        <% @results[:brands].each do |item| %>
            <li><a href="/brand/<%= item.name.parameterize %>~<%=item.id%>"> <span class="pull-right">(<%= Product.where(brand_id: item.id).count() %>)</span><%= item.name %></a></li>
---
SELECT `brands`.* FROM `brands`
SELECT COUNT(*) FROM `products` WHERE `products`.`brand_id` = 1