Ecommerce/app/views/home/_category_tab.html.erb

            <div class="tab-pane fade <%=index === 0 ? "active in" : ''%> " id="category<%=c.id  %>">
                <% c.products.each do |item| %>
---
SELECT `products`.* FROM `products` INNER JOIN `product_categories` ON `products`.`id` = `product_categories`.`product_id` WHERE `product_categories`.`category_id` = 1