Ecommerce/app/views/home/_category_blog.html.erb

SELECT COUNT(*) FROM `posts` WHERE `posts`.`category_post_id` = 1
---
        <% @results[:categoies_post].each do |item| %>
            <li><a href="/<%=I18n.locale %>/blog_category/<%= item.name.parameterize %>~<%=item.id%>"> <span class="pull-right">(<%= Post.where(category_post_id: item.id).count() %>)</span><%= item.name %></a></li>