Ecommerce/app/views/home/_slider.html.erb

						<div class="carousel-inner">
						<% if @results[:sliders].count > 0 %>
---
SELECT COUNT(*) FROM `sliders`