Ecommerce/app/views/devise/registrations/edit.html.erb

                      <select  name="user[city_id]">
                      <% unless current_user.city.blank?  %>
---
SELECT `cities`.* FROM `cities`

                      <% end %>
                        <% @results[:cities].each do |item| %>
---
SELECT `cities`.* FROM `cities`