internal social network/bt11/app/helpers/sessions_helper.rb

  def current_user
    if session[:user_id]
      @current_user ||= User.find_by(id: session[:user_id])
    elsif cookies.signed[:user_id]
      user = User.find_by(id: cookies.signed[:user_id])
      if user.present? && user.authenticated?(cookies[:remember_token])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 64 LIMIT 1