internal social network/chapter_01/app/controllers/users_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`emails` = 'thangneymar44'
---
  def index
    @email = params[:email]
    @users = @email.present? ? User.where(emails: @email) : User.all

INSERT INTO `users` (`name`, `emails`, `phone`, `age`, `created_at`, `updated_at`, `date_of_birth`, `gender`, `year`, `school`) VALUES ('Nguyễn Công Phượng', 'Phuong@gmail.com', '0986555942', 25, '2021-07-19 08:33:23.094967', '2021-07-19 08:33:23.094967', '12/03/1995', 'nam', '2007-05-12', 'HAGL')
---
  def create_user
    @user = User.new(user_params)
    respond_to do |format|
      if @user.save

UPDATE `users` SET `users`.`name` = 'tran huu thang1', `users`.`updated_at` = '2021-07-18 04:53:56.920388' WHERE `users`.`id` = 1
---
  def update_user
    respond_to do |format|
      if @user.update(user_params)